ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
/*
 * F1 — Basic motor spin, F2 — encoder RPM read
 * Edge AMR / SLAM robot — Week 2, Phase 2 (Firmware)
 *
 * F1: drive both TT motors forward at a fixed 50% PWM to prove the
 * ESP32 -> TB6612FNG -> motor path works end to end.
 * F2: count LM393 encoder pulses via ISR, compute RPM every 1s.
 * Merged into one project because F3 (PID) needs both together anyway.
 *
 * Raw hardware wiring (ESP32 38-pin DevKit  ->  TB6612FNG), UNCHANGED since
 * original solder-down — this describes the physical wires, not which
 * software label (AIN1_PIN etc.) currently points at each one (see 2026-08-11
 * note below the #defines for why those two now differ):
 *   GPIO16 -> PWMA      GPIO17 -> PWMB     (speed  — driven by LEDC)
 *   GPIO18 -> AIN1      GPIO21 -> BIN1     (direction)
 *   GPIO19 -> AIN2      GPIO22 -> BIN2     (direction)
 *   GPIO23 -> STBY                         (enable, HIGH = run)
 *   3V3    -> VCC   (logic power)
 *   VM     <- powerbank (direct, bypasses ESP32 — fixed 2026-07-24)
 *   GND    -> GND   (must be common with the powerbank ground)
 *
 * Raw hardware wiring (ESP32 -> LM393 encoders), also unchanged:
 *   GPIO34 -> encoder OUT on the TB6612 "A" side (same physical wheel as AIN1/AIN2/PWMA)
 *   GPIO35 -> encoder OUT on the TB6612 "B" side (same physical wheel as BIN1/BIN2/PWMB)
 *
 * F2 test procedure (do this BEFORE trusting F3/PID):
 *   Comment out the "wake the TB6612FNG" + direction lines in app_main so
 *   the motors stay off, flash, then spin each wheel by hand and confirm
 *   the RPM printed on the serial monitor looks sane. Only once that's
 *   verified, uncomment and let both F1 (motor) and F2 (encoder) run together.
 */

#include <math.h>
#include <stdbool.h>
#include <stdio.h>
#include <string.h>
#include "driver/gpio.h"
#include "driver/i2c_master.h"
#include "driver/ledc.h"
#include "driver/uart.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_system.h"
#include <rcl/rcl.h>
#include <rcl/error_handling.h>
#include <rclc/rclc.h>
#include <rclc/executor.h>
#include <geometry_msgs/msg/twist.h>
#include <nav_msgs/msg/odometry.h>
#include <std_msgs/msg/string.h>
#include <rmw_microros/rmw_microros.h>
#include "esp32_serial_transport.h"

/* --- Direction + enable pins: plain digital outputs (HIGH/LOW only) ---
 *
 * SWAPPED 2026-08-11 (was AIN1=18,AIN2=19 / BIN1=21,BIN2=22): the stereo
 * camera is mounted facing the chassis's ORIGINAL reverse direction, and
 * rather than re-route the CSI ribbon cable to spin the camera around
 * (this project's single biggest recurring hardware failure mode — CSI
 * cable, encoder VCC, encoder solder joint, left-motor GPIO have all
 * worked loose from handling before, see project memory), the robot's own
 * notion of "forward" was redefined in software instead so the camera's
 * facing direction becomes the new forward.
 *
 * A 180-degree redefinition of "forward" is a rigid rotation about the
 * vertical axis — it flips BOTH front/back AND left/right together, it is
 * not possible to flip just one (same principle already worked out for the
 * IMU mount orientation, see project memory 2026-07-18). This #define swap
 * is the left/right half of that: software's "channel A" (LEDC_CHANNEL_0,
 * used for target_pwm_left/ENC_L_PIN everywhere else in this file) now
 * points at the physical GPIOs that used to be TB6612 channel B, so the
 * math in control_task() — which was already correct and is NOT touched by
 * this change — now drives the wheel that is physically on the robot's new
 * left side. The front/back half of the flip is the AIN1/AIN2/BIN1/BIN2
 * polarity flip in app_main() below (0,1 instead of the original 1,0) —
 * both halves are required together, neither alone gives the right result
 * (worked through with vịt before making this change, see conversation).
 *
 * Physical wiring itself has NOT changed — only which label points at which
 * already-wired GPIO. Cross-check against the raw wiring table above if
 * this ever needs re-deriving. */
#define AIN1_PIN  GPIO_NUM_21
#define AIN2_PIN  GPIO_NUM_22
#define BIN1_PIN  GPIO_NUM_18
#define BIN2_PIN  GPIO_NUM_19
#define STBY_PIN  GPIO_NUM_23

/* --- Speed pins: driven by the LEDC PWM peripheral, not set by hand ---
 * Swapped together with AIN/BIN above, same reason. */
#define PWMA_PIN  GPIO_NUM_17
#define PWMB_PIN  GPIO_NUM_16

#define PWM_FREQ_HZ  1000   /* 1 kHz PWM carrier */
#define PWM_DUTY_50  128    /* 128 / 255 = 50% duty (8-bit resolution) */

/* --- F2: encoder pins + RPM constants ---
 * Swapped together with AIN/BIN/PWMA/PWMB above, same reason: ENC_L_PIN
 * must read the same physical wheel that LEDC_CHANNEL_0/target_pwm_left
 * now drives, or RPM feedback would be reporting the wrong wheel to its
 * own PID loop. */
#define ENC_L_PIN GPIO_NUM_35   /* left encoder signal (was 34) */
#define ENC_R_PIN GPIO_NUM_34   /* right encoder signal (was 35) */
#define SLOTS_PER_REV 20        /* LM393 disk: 20 slots = 1 full wheel revolution */

/* --- IMU (MPU6050) sanity-check read, added 2026-08-14 ---
 * Soldered pins (2026-07-29), never read from firmware until now - this is
 * the first empirical data point for the still-unverified axis-mapping
 * hypothesis in project memory (2026-07-18/20 entries). Raw int16 values
 * only - deliberately NOT converted to g/deg-per-s on-device (vịt's call):
 * keeps this firmware change tiny/additive, and the axis-mapping math is
 * easier to iterate on in Python on a real machine than to re-flash for.
 * Conversion factors for whoever processes this later: MPU6050 wakes into
 * its power-on-reset default full-scale range (ACCEL_CONFIG/GYRO_CONFIG are
 * never written here, so they stay 0x00) - that's accel +/-2g
 * (16384 LSB/g) and gyro +/-250 deg/s (131 LSB/(deg/s)).
 * AD0 assumed tied low (0x68) - the common default on breakout boards; if
 * i2c_master_probe/the wake write fails, check AD0 first (0x69 otherwise). */
#define IMU_SDA_PIN       GPIO_NUM_26
#define IMU_SCL_PIN       GPIO_NUM_25
#define MPU6050_I2C_ADDR  0x68
#define MPU6050_REG_PWR_MGMT_1   0x6B
#define MPU6050_REG_INT_PIN_CFG  0x37
#define MPU6050_I2C_BYPASS_EN    0x02
#define MPU6050_REG_ACCEL_XOUT_H 0x3B  /* accel(6) + temp(2) + gyro(6) = 14B burst */
#define IMU_READ_LEN 14

/* --- Magnetometer, added 2026-08-28 for the heading-drift fix ---
 * Lives on the MPU6050's AUX I2C bus (see MPU6050_I2C_BYPASS_EN below),
 * exposed onto the main SDA/SCL bus once bypass mode is enabled - this is
 * the compass chip on the new GY-86/GY-87-style board, added specifically
 * to stop the gyro-only heading estimate from drifting forever (see
 * README). Register map assumed HMC5883L-compatible (config A/B + mode +
 * X,Z,Y data burst - NOT X,Y,Z order) since that's the standard chip on
 * this class of board, but NOT independently confirmed - if MAG=ok but the
 * fused heading still looks wrong, this register-map assumption is the
 * first thing to re-check, not the address.
 * ADDRESS: was 0x1E (textbook HMC5883L default) - changed 2026-08-28 to
 * 0x2C after a live post-bypass I2C scan showed a real device newly
 * appearing at 0x2C (not present in the pre-bypass scan), while nothing
 * ever ACKed at 0x1E. Trusting the live scan over the datasheet default -
 * this board's actual compass chip is evidently not a stock HMC5883L, or
 * uses a non-default address strap. */
#define HMC5883L_I2C_ADDR       0x2C
#define HMC5883L_REG_CONFIG_A   0x00
#define HMC5883L_REG_CONFIG_B   0x01
#define HMC5883L_REG_MODE       0x02
#define HMC5883L_REG_DATA_X_MSB 0x03
#define HMC5883L_READ_LEN 6   /* X(2) + Z(2) + Y(2) */

/* Forward-declared: defined below setup_pwm() (near the other setup_*
 * helpers), but called from uros_task() which appears EARLIER in this file.
 * Without this, the compiler hits the call site first, assumes an
 * implicit int-returning function, then errors on the real bool-returning
 * definition later ("conflicting types") - the exact CONTROL_PERIOD_MS
 * class of bug this file has been bitten by before (declaration-order
 * bugs are silent at a glance, loud at build time - always read past the
 * first error line before assuming a fix is complete). */
static bool imu_read_raw(int16_t *ax, int16_t *ay, int16_t *az,
                          int16_t *gx, int16_t *gy, int16_t *gz);

