ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
/* Same forward-reference reason as imu_read_raw above - defined near
 * setup_magnetometer() further down, called from uros_task() above that. */
static bool mag_read_raw(int16_t *mx, int16_t *my, int16_t *mz);

/* Moved up from near control_task() (2026-07-27): pid_step() needs this for
 * its dt calculation, but #define order matters in C - the compiler had
 * never actually seen this macro yet at the point pid_step() used it,
 * since the old location was much further down in the file. That was a
 * silent build failure (`'CONTROL_PERIOD_MS' undeclared`), not a subtle
 * bug - every build since Ki was added failed here, meaning any test
 * result since then that "worked" was very likely re-flashing a stale,
 * older binary rather than the code we thought we were testing.
 *
 * Original context for the value itself: shorter window = coarser RPM
 * resolution with only 20 slots/rev. Raised 50ms -> 200ms (2026-07-27):
 * at 50ms, 1 pulse = 60 RPM/step, and a since-changed 30 RPM test target
 * sat exactly BETWEEN two measurable levels - the controller could never
 * read "at target". At 200ms, 1 pulse = 15 RPM/step - finer, though RPM
 * itself no longer depends on this window at all now (see last_interval_us
 * / RPM_STALE_US further down - period measurement replaced pulse
 * counting for the actual RPM value). This constant now only sets how
 * often PID/sync/PWM update, not measurement resolution. */
#define CONTROL_PERIOD_MS 200   /* 5 Hz */

/* --- F3: PI velocity control (Kd deliberately skipped, see KI comment below) --- */
/* TARGET_RPM (hardcoded 30, then 60) retired 2026-07-27 now that F5 wires
 * real /cmd_vel - per-wheel targets are computed live from linear.x/angular.z
 * instead (see the F5 section below). Kept using it through F1-F4 was the
 * right call (needed *some* number to validate the control loop before the
 * real command source existed) - it's just no longer the source of truth. */
/* Kp/Ki/max-integral-contribution converted from #define to live-tunable
 * globals 2026-08-27: raising the mission's speed caps exposed a real
 * steady-state PID weakness (PWM plateauing ~100-130 under real load,
 * never reaching the wheels' true target RPM) - the fixed MAX_I_CONTRIBUTION
 * below was too small to let the integral term close a persistent error on
 * this heavier-than-bench-tested robot. Rather than guess a new fixed
 * number blind and reflash repeatedly, these are now pushed live from the
 * dashboard over /pid_gains (see pid_gains_callback below and the
 * dashboard's PID box in search_and_rescue.py) so they can be tuned against
 * the real load in real time. Defaults are just the starting point - not
 * meant to be the final tuned values anymore. */
static volatile float g_kp = 3.0f;             /* start small, increase until oscillation appears, back off */
static volatile float g_ki = 0.2f;
/* Anti-windup: without SOME limit, integral grows unbounded whenever output
 * is pinned at MIN/MAX_SAFE_PWM (e.g. a stalled wheel), causing a huge
 * overshoot once it frees up. Was a fixed 40.0f contribution cap - too
 * tight for real load, hence live-tunable now too. */
static volatile float g_max_i_contribution = 40.0f;

/* --- Heading control, replaces the old encoder-distance "wheel sync" (2026-08-28) ---
 * OLD approach: per-wheel PID kept each wheel near its own target RPM
 * independently (two separate error/integral tracks), plus a separate trim
 * based on comparing cumulative encoder PULSE COUNT between the two wheels.
 * Confirmed live: this let each wheel's loop hunt independently against its
 * own noisy/quantized encoder reading, and the sync trim itself was reacting
 * to an indirect signal (accumulated pulse-count drift) rather than the
 * actual physical thing that matters (is the robot actually rotating when it
 * shouldn't be, or rotating at the wrong rate when it should).
 *
 * NEW approach: ONE shared speed PID drives an averaged target (see
 * control_task below), and heading correction comes directly from the gyro -
 * compare the COMMANDED turn rate (angular.z) against the MEASURED turn rate
 * (imu_gz_rad_per_s_shared) every cycle, PROPORTIONAL only (no integral -
 * matches this codebase's own "start simple" philosophy; add I later only if
 * real testing shows a persistent steady-state heading error P alone can't
 * close). This runs continuously and unconditionally - no more
 * "only while going straight" gate, because rate-tracking naturally covers
 * both cases: commanded rate 0 -> holds straight, commanded rate nonzero ->
 * tracks the requested turn. Applied in the SIGNED target-RPM domain (before
 * the left/right magnitude split), same slot in the math the old sync_trim
 * used - verified this generalizes correctly to in-place turns (opposite-
 * signed wheel targets), unlike a naive +/- on the final PWM magnitude,
 * which cancels to zero net effect for that case (worked through the
 * algebra before implementing this way - a simpler-looking version that
 * applies the trim directly to PWM instead of signed RPM target would have
 * silently broken in-place turns).
 * Falls back to trim=0 (not the old encoder-based estimate) whenever the IMU
 * read is invalid - same "never trust a dead/stale sensor" philosophy as
 * imu_gz_valid_shared elsewhere in this file, safer than silently reverting
 * to the noisier encoder-diff signal mid-drive. */
static volatile float g_kheading = 15.0f;   /* RPM of trim per rad/s of heading-rate error - live-tunable, see pid_gains_callback */
#define MAX_HEADING_TRIM_RPM 20.0f          /* clamp: don't let heading correction alone dominate the base speed target */

/* Manual per-wheel PWM trim (2026-08-28) - a flat PWM offset added on top of
 * everything the PID/heading loops already decided, for compensating a
 * mechanically weaker motor (different friction/torque between the two
 * physical motors - not something a speed PID or heading PID is meant to
 * fix, since it's a per-wheel hardware asymmetry, not an error signal).
 * Live-tunable via the same /pid_gains mechanism as Kp/Ki/etc (see
 * pid_gains_callback) - deliberately NOT touched by pid_step's target==0
 * safety bypass (see the avg_target_rpm > 0.01f gate at its application
 * site below): a commanded stop must still mean PWM=0, trim included -
 * otherwise a stale/lost /cmd_vel would leave one wheel creeping instead of
 * actually stopping, defeating the whole point of that safety bypass. */
static volatile float g_trim_left = 0.0f;
static volatile float g_trim_right = 0.0f;

/* --- F4: odometry (measured 2026-07-27: wheelbase 10cm; wheel diameter
 * re-measured 2026-08-26 as 6.7cm, corrected from the original 6cm) ---
 * distance per pulse = wheel circumference / slots per rev - converts a raw
 * pulse count directly into linear distance traveled by that wheel.
 * Differential-drive kinematics: center-of-robot distance is the AVERAGE of
 * the two wheels' distances (if both go the same distance, robot moves
 * straight with no turn); heading change is the DIFFERENCE divided by the
 * wheelbase (if right travels further than left, robot rotates toward the
 * left/slower side - matches the direction convention already confirmed
 * earlier today: faster right wheel -> drifts left). */
#define WHEEL_DIAMETER_M 0.067f
#define WHEELBASE_M 0.10f
#define PI_F 3.14159265f   /* not relying on M_PI - not guaranteed defined by every libc without _USE_MATH_DEFINES */
#define WHEEL_CIRCUMFERENCE_M (PI_F * WHEEL_DIAMETER_M)
#define DISTANCE_PER_PULSE_M (WHEEL_CIRCUMFERENCE_M / SLOTS_PER_REV)

/* --- F5: /cmd_vel in, /odom out (2026-07-27) ---
 * Safety default: if no /cmd_vel received within this long (agent crash,
 * USB unplugged, Jetson down), treat commanded velocity as 0 rather than
 * keep driving on the last command received - a lost connection must mean
 * "stop", never "keep going blind". Applies both before the first command
 * ever arrives AND if a live connection drops mid-drive. */
#define CMD_VEL_TIMEOUT_US 1000000   /* 1s */

