ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
        /* RPM from time between pulses, not pulses-per-window - see
         * last_interval_us / RPM_STALE_US comments above for why. */
        rpm_left_shared = (interval_left == 0 || (now - last_edge_left) > RPM_STALE_US)
                              ? 0.0f : 60000000.0f / (SLOTS_PER_REV * (float)interval_left);
        rpm_right_shared = (interval_right == 0 || (now - last_edge_right) > RPM_STALE_US)
                              ? 0.0f : 60000000.0f / (SLOTS_PER_REV * (float)interval_right);

        /* F4 odometry: how far each wheel moved THIS cycle (not cumulative),
         * then combine into how far the robot's center moved + how much it
         * turned. Midpoint integration (average current and new heading,
         * not just the old one) instead of plain Euler - at 200ms/cycle a
         * turning robot's heading can shift enough mid-cycle that using only
         * the pre-turn heading for the whole cycle's distance would visibly
         * bias x/y, especially while turning sharply. */
        float dist_left  = snapshot_left  * DISTANCE_PER_PULSE_M;
        float dist_right = snapshot_right * DISTANCE_PER_PULSE_M;
        float dist_center = (dist_left + dist_right) / 2.0f;
        float dt = CONTROL_PERIOD_MS / 1000.0f;

        /* Heading (2026-08-22): the encoder-differential dtheta below is
         * exactly what causes the documented ~-5 to -16deg wobble on a
         * nominally-straight command - wheel slip/quantization shows up
         * directly as false rotation. Prefer the gyro whenever the most
         * recent IMU read succeeded (no wheel-contact dependency at all);
         * snapshot both shared vars once, matching the pulse-count
         * snapshot pattern above, since uros_task writes them
         * concurrently. Falls back to pure encoder dtheta - the original,
         * already-proven formula - whenever the IMU hasn't initialized or
         * has latched dead (see imu_gz_valid_shared comment above): never
         * blend in a stale/failed gyro reading. */
        bool imu_gz_ok = imu_gz_valid_shared;
        float imu_gz_rad_per_s = imu_gz_rad_per_s_shared;
        float dtheta_encoder = (dist_right - dist_left) / WHEELBASE_M;
        float dtheta = imu_gz_ok ? (imu_gz_rad_per_s * dt) : dtheta_encoder;
        float theta_mid = pose_theta_shared + dtheta / 2.0f;

        pose_x_shared += dist_center * cosf(theta_mid);
        pose_y_shared += dist_center * sinf(theta_mid);
        pose_theta_shared += dtheta;

        /* Magnetometer fusion (2026-08-28): the gyro integration above
         * accumulates drift forever with nothing to correct it. Whenever a
         * valid compass heading is available, slowly drag pose_theta_shared
         * back toward it - complementary filter, see MAG_FUSION_WEIGHT
         * comment above. Angle-wrap-safe (compares the shortest way around
         * the circle, not raw subtraction, so it can't get a bogus huge
         * correction crossing the +/-180deg seam). */
        if (mag_heading_valid_shared) {
            float mag_diff = mag_heading_rad_shared - pose_theta_shared;
            if (mag_diff > PI_F)  mag_diff -= 2.0f * PI_F;
            if (mag_diff < -PI_F) mag_diff += 2.0f * PI_F;
            pose_theta_shared += MAG_FUSION_WEIGHT * mag_diff;
        }

        linear_vel_shared  = dist_center / dt;
        angular_vel_shared = dtheta / dt;

        /* F5: /cmd_vel -> per-wheel target RPM. Watchdog: stale command (or
         * none ever received) means 0, not "keep driving" - see
         * CMD_VEL_TIMEOUT_US comment above. */
        bool cmd_vel_fresh = (now - last_cmd_vel_us) <= CMD_VEL_TIMEOUT_US;
        float linear_x  = cmd_vel_fresh ? cmd_linear_x  : 0.0f;
        float angular_z = cmd_vel_fresh ? cmd_angular_z : 0.0f;

        float v_left_mps  = linear_x - angular_z * WHEELBASE_M / 2.0f;
        float v_right_mps = linear_x + angular_z * WHEELBASE_M / 2.0f;
        float target_rpm_left  = v_left_mps  / WHEEL_CIRCUMFERENCE_M * 60.0f;
        float target_rpm_right = v_right_mps / WHEEL_CIRCUMFERENCE_M * 60.0f;

        /* Heading trim, IMU-driven (2026-08-28, replaces the old encoder-
         * distance sync trim - see the big comment above g_kheading for the
         * full reasoning). Compare commanded turn rate to the gyro's
         * MEASURED turn rate - unconditional, no "only while going
         * straight" gate needed, since this naturally covers both: commanded
         * 0 -> holds straight, commanded nonzero -> tracks the turn.
         * Zero trim (not an encoder-based guess) whenever the IMU read is
         * invalid - never correct off a signal we don't trust. Applied in
         * the SIGNED target-RPM domain, same spot the old sync_trim used -
         * this is what makes it generalize correctly to in-place turns
         * (opposite-signed wheel targets). */
        float heading_trim_rpm = 0.0f;
        if (imu_gz_valid_shared) {
            float heading_rate_error = angular_z - imu_gz_rad_per_s_shared;
            heading_trim_rpm = g_kheading * heading_rate_error;
            if (heading_trim_rpm > MAX_HEADING_TRIM_RPM)  heading_trim_rpm = MAX_HEADING_TRIM_RPM;
            if (heading_trim_rpm < -MAX_HEADING_TRIM_RPM) heading_trim_rpm = -MAX_HEADING_TRIM_RPM;
        }

        float signed_target_left  = target_rpm_left  - heading_trim_rpm;
        float signed_target_right = target_rpm_right + heading_trim_rpm;

        /* Direction pins, set every cycle from this cycle's target sign.
         * BUG FIXED 2026-08-26: these were only ever set ONCE at boot (see
         * app_main), always to forward, and never updated here. PID/PWM
         * only ever computes a MAGNITUDE (the single-channel encoders can't
         * report direction either, so actual_rpm is always >=0 too) -
         * direction is a separate concern that has to be set explicitly.
         * Any command needing a wheel to reverse (e.g. an in-place turn,
         * where the inner wheel's target goes negative) was silently
         * clamped to PWM=0 by pid_step's MIN_SAFE_PWM floor instead of
         * actually reversing - that wheel was completely dead the whole
         * time, which is why in-place turns couldn't move the (heavy)
         * robot even with PWM ramping up on the other wheel: it was trying
         * to drag the whole chassis around a single stationary wheel using
         * only one motor. AIN1=0/AIN2=1 (BIN1=0/BIN2=1) = forward, per the
         * flipped convention set in app_main - reverse is the opposite pair. */
        gpio_set_level(AIN1_PIN, signed_target_left  < 0.0f ? 1 : 0);
        gpio_set_level(AIN2_PIN, signed_target_left  < 0.0f ? 0 : 1);
        gpio_set_level(BIN1_PIN, signed_target_right < 0.0f ? 1 : 0);
        gpio_set_level(BIN2_PIN, signed_target_right < 0.0f ? 0 : 1);

        /* Speed regulation, ONE shared PID on the AVERAGE of the two wheels
         * (2026-08-28, replaces two independent per-wheel PID calls - see
         * the comment above g_kheading for why running two separately was
         * likely a real cause of the reported jitter: each wheel's loop
         * hunting independently against its own noisy encoder reading, with
         * no coordination between them). avg_target_rpm already has the
         * heading trim baked in (via signed_target_left/right above), so
         * the left/right split below still correctly reflects any commanded
         * turn - it's just driven by one shared error/integral track instead
         * of two competing ones. */
        float avg_target_rpm = (fabsf(signed_target_left) + fabsf(signed_target_right)) / 2.0f;
        float avg_actual_rpm = (rpm_left_shared + rpm_right_shared) / 2.0f;
        float base_pwm = (float)pid_step(avg_target_rpm, avg_actual_rpm, &integral_speed);

        /* Distribute the shared base_pwm between the two wheels, keeping
         * the same left/right ratio their (trim-corrected) targets imply -
         * e.g. an in-place turn wants both wheels at roughly equal
         * magnitude, a gentle curve wants a small imbalance. Guarded
         * against divide-by-zero when the robot is commanded to a stop
         * (avg_target_rpm == 0, in which case pid_step already returns 0
         * for base_pwm too, so the ratio doesn't matter). */
        float left_ratio  = (avg_target_rpm > 0.01f) ? (fabsf(signed_target_left)  / avg_target_rpm) : 1.0f;
        float right_ratio = (avg_target_rpm > 0.01f) ? (fabsf(signed_target_right) / avg_target_rpm) : 1.0f;
        float target_pwm_left  = base_pwm * left_ratio;
        float target_pwm_right = base_pwm * right_ratio;

        /* Manual trim, added last - only while actually commanded to move
         * (same avg_target_rpm > 0.01f condition as the ratio split above),
         * so a commanded/watchdog stop still means true PWM=0 on both
         * wheels, trim included. Clamped both ends now (not just the top) -
         * trim didn't exist when the original MAX_SAFE_PWM-only clamp was
         * written, and a negative trim could otherwise push this below 0
         * before the uint32_t cast a few lines down, wrapping into a huge
         * PWM value instead of a small negative one. */
        if (avg_target_rpm > 0.01f) {
            target_pwm_left  += g_trim_left;
            target_pwm_right += g_trim_right;
        }
        if (target_pwm_left  < 0.0f) target_pwm_left  = 0.0f;
        if (target_pwm_right < 0.0f) target_pwm_right = 0.0f;
        if (target_pwm_left  > MAX_SAFE_PWM) target_pwm_left  = MAX_SAFE_PWM;
        if (target_pwm_right > MAX_SAFE_PWM) target_pwm_right = MAX_SAFE_PWM;

        applied_pwm_left  = target_pwm_left;
        applied_pwm_right = target_pwm_right;
        pwm_left_shared  = applied_pwm_left;
        pwm_right_shared = applied_pwm_right;

        ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_0, (uint32_t)applied_pwm_left);
        ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_0);
        ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_1, (uint32_t)applied_pwm_right);
        ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_1);

        /* Stall watch, left wheel */
        if (applied_pwm_left > STALL_PWM_THRESHOLD && snapshot_left == 0) {
            stall_cycles_left++;
            if (stall_cycles_left == STALL_CYCLE_LIMIT) {
                ESP_LOGW(TAG, "LEFT encoder stall suspected: PWM=%.0f but 0 pulses for %ds",
                         applied_pwm_left, STALL_CYCLE_LIMIT * CONTROL_PERIOD_MS / 1000);
            }
        } else {
            stall_cycles_left = 0;
        }

        /* Stall watch, right wheel */
        if (applied_pwm_right > STALL_PWM_THRESHOLD && snapshot_right == 0) {
            stall_cycles_right++;
            if (stall_cycles_right == STALL_CYCLE_LIMIT) {
                ESP_LOGW(TAG, "RIGHT encoder stall suspected: PWM=%.0f but 0 pulses for %ds",
                         applied_pwm_right, STALL_CYCLE_LIMIT * CONTROL_PERIOD_MS / 1000);
            }
        } else {
            stall_cycles_right = 0;
        }

        /* NOTE (F5): once uros_task's custom transport claims UART0, this
         * won't show up on idf.py monitor anymore - debug via `ros2 topic
         * echo /odom` / `ros2 topic pub /cmd_vel` on the Jetson instead.
         * Left in place since it's harmless and still useful for standalone
         * bring-up before uros_task's transport takes over. */
        ESP_LOGI(TAG, "RPM L=%.1f R=%.1f  PWM L=%.0f R=%.0f  head_trim=%.1f  "
                      "pose x=%.3fm y=%.3fm theta=%.1fdeg",
                 rpm_left_shared, rpm_right_shared, applied_pwm_left, applied_pwm_right,
                 heading_trim_rpm, pose_x_shared, pose_y_shared, pose_theta_shared * 180.0f / PI_F);
    }
}

/* rclc_executor callback for the /cmd_vel subscription - just latches the
 * values and timestamps them for the watchdog. Runs in uros_task's context
 * (not an ISR), so no special atomicity concerns beyond the usual volatile. */
/* F5 diagnostics (2026-07-27): odometry was observed resetting toward 0
 * repeatedly during a real driving test, and the agent log showed the
 * micro-ROS client_key changing (new session) at the same time - strong
 * evidence the ESP32 itself is rebooting mid-drive, not just losing the
 * micro-ROS connection. Since console logging is muted (shares UART0 with
 * the transport - see esp_log_level_set below), there's no way to see a
 * reboot reason via idf.py monitor while /cmd_vel testing is happening.
 * Instead: read esp_reset_reason() once at boot (before anything else
 * runs) and publish it over the already-working micro-ROS link, so
 * `ros2 topic echo /esp32_diag` answers "was that a brownout?" without
 * needing the serial console at all. */
static esp_reset_reason_t g_reset_reason;

/* Populated once by i2c_scan_bus() (defined near setup_imu() below),
 * surfaced in /esp32_diag - lets us see what (if anything) actually ACKs
 * on the I2C bus without needing idf.py monitor (which can't run at the
 * same time as the micro-ROS agent, since both want exclusive UART0).
 * "unscanned" means setup_imu() never got far enough to run the scan
 * (bus creation itself failed). Declared up here, not next to
 * i2c_scan_bus() itself, because uros_task() (which reads it for the
 * diag string) is defined earlier in this file than setup_imu() - same
 * forward-reference trap as g_reset_reason above. */
static char g_i2c_scan_result[40] = "unscanned";

/* Which retry attempt (1-5) the IMU wake-up write succeeded on, 0 if never
 * attempted (bus/device setup itself failed), -1 if all 5 attempts failed.
 * Surfaced in /esp32_diag alongside g_i2c_scan_result - if this lands on
 * attempt 2-5 rather than always 1 or always -1, that's a strong signal of
 * a marginal/intermittent physical connection rather than a clean pass/fail. */
static int g_imu_wake_attempts = 0;

static const char *reset_reason_str(esp_reset_reason_t reason) {
    switch (reason) {
        case ESP_RST_POWERON:   return "POWERON";
        case ESP_RST_EXT:       return "EXT_PIN";
        case ESP_RST_SW:        return "SW_RESTART";
        case ESP_RST_PANIC:     return "PANIC";
        case ESP_RST_INT_WDT:   return "INT_WATCHDOG";
        case ESP_RST_TASK_WDT:  return "TASK_WATCHDOG";
        case ESP_RST_WDT:       return "OTHER_WATCHDOG";
        case ESP_RST_DEEPSLEEP: return "DEEPSLEEP_WAKE";
        case ESP_RST_BROWNOUT:  return "BROWNOUT";
        case ESP_RST_SDIO:      return "SDIO";
        default:                return "UNKNOWN";
    }
}

static void cmd_vel_callback(const void *msgin) {
    const geometry_msgs__msg__Twist *msg = (const geometry_msgs__msg__Twist *)msgin;
    cmd_linear_x    = (float)msg->linear.x;
    cmd_angular_z   = (float)msg->angular.z;
    last_cmd_vel_us = esp_timer_get_time();
}

/* Live PID gain updates (2026-08-27) - the dashboard publishes a plain text
 * command instead of a std_msgs/Float32MultiArray on purpose: this project's
 * micro-ROS build only has bounded-string sequences proven working (see
 * diag_msg/imu_msg), and a dynamic-array message type would need new
 * colcon.meta bounds + a full library rebuild to add mid-session - real risk
 * for zero benefit over just parsing three numbers out of a string. Malformed
 * text (wrong field count, e.g. a stale/partial message) is silently ignored
 * - gains only change on an unambiguous full match, never partially. */
static void pid_gains_callback(const void *msgin) {
    const std_msgs__msg__String *msg = (const std_msgs__msg__String *)msgin;
    float kp, ki, max_i, khead, trim_l, trim_r;
    if (sscanf(msg->data.data, "KP=%f,KI=%f,MAXI=%f,KHEAD=%f,TRIML=%f,TRIMR=%f",
               &kp, &ki, &max_i, &khead, &trim_l, &trim_r) == 6) {
        g_kp = kp;
        g_ki = ki;
        g_max_i_contribution = max_i;
        g_kheading = khead;
        g_trim_left = trim_l;
        g_trim_right = trim_r;
    }
}

/* F5: connects to the micro-ROS agent, subscribes /cmd_vel, publishes /odom.
 * Structured the same way as the proven esp32/microros_hello.c pattern
 * (Week 1) - outer loop pings the agent and (re)creates everything on
 * connect, inner loop runs while the agent stays reachable, and everything
 * gets torn down and retried if the agent disappears.
 * No printf()/ESP_LOG calls anywhere in this function or its callers from
 * here on - confirmed live (2026-07-27) that ANY console write to UART0
 * corrupts the micro-ROS binary stream sharing the same wire, including
 * during the ping-agent phase. Silence is required, not just tidiness. */
static void uros_task(void *arg) {
    while (1) {
        while (rmw_uros_ping_agent(1000, 1) != RMW_RET_OK) {
            vTaskDelay(pdMS_TO_TICKS(500));
        }

        rcl_allocator_t allocator = rcl_get_default_allocator();
        rclc_support_t support;
        rcl_node_t node;
        rcl_subscription_t cmd_vel_sub;
        rcl_subscription_t pid_gains_sub;
        rcl_publisher_t odom_pub;
        rcl_publisher_t diag_pub;
        rcl_publisher_t imu_pub;
        rclc_executor_t executor;
        geometry_msgs__msg__Twist cmd_vel_msg;
        std_msgs__msg__String pid_gains_msg = {0};
        nav_msgs__msg__Odometry odom_msg = {0};
        std_msgs__msg__String diag_msg = {0};
        std_msgs__msg__String imu_msg = {0};
        char pid_gains_text[128];  /* was 64 -- too small once KHEAD/TRIML/TRIMR were added
                                     * to the KP/KI/MAXI format (2026-08-27): the full 6-field
                                     * string is already ~72 bytes even at small values, so
                                     * every /pid_gains update was silently truncated and
                                     * failing pid_gains_callback's exact 6-field sscanf match
                                     * -- no gain change (not just Khead/Trim) was ever
                                     * actually reaching the firmware. */
        char diag_text[320];   /* grown from 96/112/160/200/280 -- added TRIML/TRIMR fields plus
                                 * the existing RPM/PWM/KP/KI/MAXI/KHEAD/I2C/WAKE/GZ/MAG/MX/MY/MZ/
                                 * MAGHDG fields plus g_i2c_scan_result's own 40-char worst case can
                                 * exceed 200 */
        char imu_text[80];

        if (rclc_support_init(&support, 0, NULL, &allocator) != RCL_RET_OK) {
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_node_init_default(&node, "esp32_motor_node", "", &support) != RCL_RET_OK) {
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_subscription_init_default(&cmd_vel_sub, &node,
                ROSIDL_GET_MSG_TYPE_SUPPORT(geometry_msgs, msg, Twist), "cmd_vel") != RCL_RET_OK) {
            if (rcl_node_fini(&node) != RCL_RET_OK) {}
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_subscription_init_default(&pid_gains_sub, &node,
                ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, String), "pid_gains") != RCL_RET_OK) {
            if (rcl_subscription_fini(&cmd_vel_sub, &node) != RCL_RET_OK) {}
            if (rcl_node_fini(&node) != RCL_RET_OK) {}
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_publisher_init_default(&odom_pub, &node,
                ROSIDL_GET_MSG_TYPE_SUPPORT(nav_msgs, msg, Odometry), "odom") != RCL_RET_OK) {
            if (rcl_subscription_fini(&pid_gains_sub, &node) != RCL_RET_OK) {}
            if (rcl_subscription_fini(&cmd_vel_sub, &node) != RCL_RET_OK) {}
            if (rcl_node_fini(&node) != RCL_RET_OK) {}
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_publisher_init_default(&diag_pub, &node,
                ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, String), "esp32_diag") != RCL_RET_OK) {
            if (rcl_publisher_fini(&odom_pub, &node) != RCL_RET_OK) {}
            if (rcl_subscription_fini(&pid_gains_sub, &node) != RCL_RET_OK) {}
            if (rcl_subscription_fini(&cmd_vel_sub, &node) != RCL_RET_OK) {}
            if (rcl_node_fini(&node) != RCL_RET_OK) {}
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_publisher_init_default(&imu_pub, &node,
                ROSIDL_GET_MSG_TYPE_SUPPORT(std_msgs, msg, String), "imu_raw") != RCL_RET_OK) {
            if (rcl_publisher_fini(&diag_pub, &node) != RCL_RET_OK) {}
            if (rcl_publisher_fini(&odom_pub, &node) != RCL_RET_OK) {}
            if (rcl_subscription_fini(&pid_gains_sub, &node) != RCL_RET_OK) {}
            if (rcl_subscription_fini(&cmd_vel_sub, &node) != RCL_RET_OK) {}
            if (rcl_node_fini(&node) != RCL_RET_OK) {}
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }

