ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
                /* Rebuilt every cycle now (see comment above) - live
                 * per-wheel RPM/PWM for hardware debugging, since
                 * idf.py monitor is unusable once this transport owns
                 * UART0 (see note above cmd_vel_callback). Moved to AFTER
                 * both the IMU and magnetometer reads above (2026-08-28,
                 * was built earlier in this same function before either had
                 * run) so it reports THIS cycle's values, not last cycle's -
                 * and now includes raw MX/MY/MZ + the computed pre-fusion
                 * compass heading (MAGHDG), added specifically to debug the
                 * "heading keeps drifting back to ~17deg" report: this
                 * shows directly whether the raw magnetometer values
                 * actually change as the robot physically rotates (a real
                 * sensor reading real world) or stay put regardless of
                 * orientation (nearby magnetic interference - e.g. the
                 * drive motors' permanent magnets - or a wrong axis in the
                 * atan2f call swamping the real signal). */
                snprintf(diag_text, sizeof(diag_text),
                         "reset=%s RPM L=%.1f R=%.1f PWM L=%.0f R=%.0f KP=%.2f KI=%.2f MAXI=%.1f KHEAD=%.1f TRIML=%.1f TRIMR=%.1f I2C=%s WAKE=%d GZ=%s GZBIAS=%.1f MAG=%s MX=%d MY=%d MZ=%d MAGHDG=%.1f",
                         reset_reason_str(g_reset_reason),
                         rpm_left_shared, rpm_right_shared,
                         pwm_left_shared, pwm_right_shared,
                         g_kp, g_ki, g_max_i_contribution, g_kheading, g_trim_left, g_trim_right,
                         g_i2c_scan_result, g_imu_wake_attempts,
                         imu_gz_valid_shared ? "ok" : "no-read",
                         g_gyro_z_bias_raw / 131.0f,   /* raw LSB -> deg/s, human-readable */
                         mag_heading_valid_shared ? "ok" : "no-read",
                         mag_x, mag_y, mag_z,
                         mag_heading_rad_shared * 180.0f / PI_F);
                diag_msg.data.size = strlen(diag_text);

                if (rcl_publish(&diag_pub, &diag_msg, NULL) != RCL_RET_OK) {
                    agent_ok = false;
                }
            }

            /* BUG FOUND 2026-07-27 (F5 first connectivity test): timeout=0
             * gives the ping response no time to actually arrive over the
             * UART round-trip, so it reported "failed" almost every cycle
             * even with the agent alive and working - confirmed live as a
             * connect/create-everything/disconnect loop every ~1-2s, right
             * after all the ROS entities were successfully created. 100ms
             * is generous for a serial round-trip without blocking the
             * executor/publish loop for long. */
            if (rmw_uros_ping_agent(100, 1) != RMW_RET_OK) {
                agent_ok = false;
            }
            vTaskDelay(pdMS_TO_TICKS(20));
        }

        if (rcl_publisher_fini(&imu_pub, &node) != RCL_RET_OK) {}
        if (rcl_publisher_fini(&diag_pub, &node) != RCL_RET_OK) {}
        if (rcl_publisher_fini(&odom_pub, &node) != RCL_RET_OK) {}
        if (rcl_subscription_fini(&pid_gains_sub, &node) != RCL_RET_OK) {}
        if (rcl_subscription_fini(&cmd_vel_sub, &node) != RCL_RET_OK) {}
        if (rclc_executor_fini(exec) != RCL_RET_OK) {}
        if (rcl_node_fini(&node) != RCL_RET_OK) {}
        rclc_support_fini(&support);
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

/* Configure the five direction/enable pins as digital outputs. */
static void setup_gpio(void) {
    gpio_config_t cfg = {
        .pin_bit_mask = (1ULL << AIN1_PIN) | (1ULL << AIN2_PIN) |
                        (1ULL << BIN1_PIN) | (1ULL << BIN2_PIN) |
                        (1ULL << STBY_PIN),
        .mode = GPIO_MODE_OUTPUT,
    };
    ESP_ERROR_CHECK(gpio_config(&cfg));
}

/* Configure the LEDC hardware to generate PWM on PWMA and PWMB.
 * LEDC does the fast HIGH/LOW switching in hardware, so app_main never
 * has to toggle the pin itself. */
static void setup_pwm(void) {
    ledc_timer_config_t timer = {
        .speed_mode      = LEDC_HIGH_SPEED_MODE,
        .duty_resolution = LEDC_TIMER_8_BIT,   /* duty range 0..255 */
        .timer_num       = LEDC_TIMER_0,
        .freq_hz         = PWM_FREQ_HZ,
        .clk_cfg         = LEDC_AUTO_CLK,
    };
    ESP_ERROR_CHECK(ledc_timer_config(&timer));

    ledc_channel_config_t ch_a = {
        .gpio_num   = PWMA_PIN,
        .speed_mode = LEDC_HIGH_SPEED_MODE,
        .channel    = LEDC_CHANNEL_0,
        .timer_sel  = LEDC_TIMER_0,
        .duty       = PWM_DUTY_50,
        .hpoint     = 0,
    };
    ESP_ERROR_CHECK(ledc_channel_config(&ch_a));

    ledc_channel_config_t ch_b = {
        .gpio_num   = PWMB_PIN,
        .speed_mode = LEDC_HIGH_SPEED_MODE,
        .channel    = LEDC_CHANNEL_1,
        .timer_sel  = LEDC_TIMER_0,
        .duty       = PWM_DUTY_50,
        .hpoint     = 0,
    };
    ESP_ERROR_CHECK(ledc_channel_config(&ch_b));
}

/* Set once in app_main(), read (not written) by uros_task() afterward - no
 * cross-task synchronization needed for this handle itself (it's immutable
 * after setup), unlike the encoder pulse counters which DO cross an
 * ISR/task boundary and need portENTER_CRITICAL. */
static i2c_master_dev_handle_t imu_dev = NULL;

/* Magnetometer device handle, same lifecycle/threading rules as imu_dev
 * above - set once by setup_magnetometer() (called from setup_imu(), see
 * below), read-only afterward. g_mag_heading_offset_rad/g_mag_calibrated are
 * declared earlier in the file (near mag_heading_rad_shared) - see the
 * comment there for why. */
static i2c_master_dev_handle_t mag_dev = NULL;

/* One-shot diagnostic: probe every valid 7-bit address (1-126) and record
 * which ones ACK. TEMPORARY debugging aid for the 2026-08-20 imu_read_failed
 * investigation (wiring/power/continuity all confirmed OK by hand, so the
 * remaining question is literally "is anything answering, and at what
 * address" - AD0 tied high would put the MPU6050 at 0x69, not the 0x68
 * this firmware hardcodes). Fine to remove once the IMU is confirmed
 * working - not something to keep running on every boot forever. */
static void i2c_scan_bus(i2c_master_bus_handle_t bus_handle) {
    char *p = g_i2c_scan_result;
    char *end = g_i2c_scan_result + sizeof(g_i2c_scan_result);
    int found = 0;
    for (uint8_t addr = 1; addr < 127; addr++) {
        if (i2c_master_probe(bus_handle, addr, 30) == ESP_OK) {
            int n = snprintf(p, end - p, found ? ",%02X" : "%02X", addr);
            if (n > 0 && p + n < end) {
                p += n;
            }
            found++;
        }
    }
    if (!found) {
        snprintf(g_i2c_scan_result, sizeof(g_i2c_scan_result), "none");
    }
}

/* Bring up the HMC5883L magnetometer on the same I2C bus as the MPU6050.
 * Same soft-fail philosophy as setup_imu() below: a bad/unplugged compass
 * should not take down the already-proven motor/encoder/odom path. Config
 * values are the standard, widely-used HMC5883L init sequence: 8-sample
 * averaging + 15Hz output (Config A), default +/-1.3 Ga gain (Config B),
 * continuous-measurement mode (Mode) - the chip otherwise powers up in
 * single-measurement mode, which would only ever return one reading. */
static void setup_magnetometer(i2c_master_bus_handle_t bus_handle) {
    i2c_device_config_t dev_cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = HMC5883L_I2C_ADDR,
        .scl_speed_hz = 100000,
    };
    if (i2c_master_bus_add_device(bus_handle, &dev_cfg, &mag_dev) != ESP_OK) {
        mag_dev = NULL;
        return;
    }
    uint8_t cfg_a[2] = { HMC5883L_REG_CONFIG_A, 0x70 };
    uint8_t cfg_b[2] = { HMC5883L_REG_CONFIG_B, 0x20 };
    uint8_t mode[2]  = { HMC5883L_REG_MODE,     0x00 };
    if (i2c_master_transmit(mag_dev, cfg_a, sizeof(cfg_a), pdMS_TO_TICKS(100)) != ESP_OK ||
        i2c_master_transmit(mag_dev, cfg_b, sizeof(cfg_b), pdMS_TO_TICKS(100)) != ESP_OK ||
        i2c_master_transmit(mag_dev, mode,  sizeof(mode),  pdMS_TO_TICKS(100)) != ESP_OK) {
        mag_dev = NULL;
        return;
    }
    vTaskDelay(pdMS_TO_TICKS(10));  /* short settle time after the mode-register write */
}

/* Bring up the I2C bus + MPU6050 device and wake it from sleep.
 * Deliberately NOT ESP_ERROR_CHECK'd end-to-end like setup_gpio/setup_pwm:
 * a bad/unplugged IMU should not crash-loop the whole robot and take the
 * already-proven motor/encoder/odom path down with it. imu_dev stays NULL
 * on any failure; imu_read_raw() checks that and no-ops. */
static void setup_imu(void) {
    /* MPU6050 needs some tens of ms after power-up before it reliably
     * answers on I2C (datasheet power-on-reset timing). setup_gpio()/
     * setup_pwm() above already burn a little time, but not reliably
     * enough to depend on - without this, a cold boot could race the
     * sensor and permanently disable IMU reads for that whole session
     * (see imu_dev = NULL below) even though nothing is actually wrong. */
    vTaskDelay(pdMS_TO_TICKS(50));

    i2c_master_bus_config_t bus_cfg = {
        .clk_source = I2C_CLK_SRC_DEFAULT,
        .i2c_port = I2C_NUM_0,
        .scl_io_num = IMU_SCL_PIN,
        .sda_io_num = IMU_SDA_PIN,
        .glitch_ignore_cnt = 7,
        .flags.enable_internal_pullup = true,
    };
    i2c_master_bus_handle_t bus_handle;
    if (i2c_new_master_bus(&bus_cfg, &bus_handle) != ESP_OK) {
        return;
    }

    /* 2026-08-20: was 400000 (Fast Mode). Real writes (the PWR_MGMT_1 wake
     * command below) were failing while i2c_master_probe() - a much lighter
     * transaction - still ACKed fine at the same address. Classic breadboard
     * symptom: internal ESP32 pull-ups + jumper wire capacitance can't
     * reliably hold Fast Mode timing even though the device is genuinely
     * present and wired correctly. Standard Mode (100kHz) is far more
     * tolerant of exactly this. */
    i2c_device_config_t dev_cfg = {
        .dev_addr_length = I2C_ADDR_BIT_LEN_7,
        .device_address = MPU6050_I2C_ADDR,
        .scl_speed_hz = 100000,
    };
    if (i2c_master_bus_add_device(bus_handle, &dev_cfg, &imu_dev) != ESP_OK) {
        imu_dev = NULL;
        return;
    }

    /* Retried rather than one-shot: i2c_master_probe() above already
     * confirmed the device ACKs its address, so if this still fails outright
     * every time, address/wiring isn't the question anymore - only whether
     * a real (multi-byte) transaction can get through at all. Retrying
     * turns "always fails" vs. "succeeds on attempt N" into a diagnostic:
     * the latter points at a marginal/intermittent connection rather than
     * a clean broken/not-broken wiring fault. */
    uint8_t wake_cmd[2] = { MPU6050_REG_PWR_MGMT_1, 0x00 };
    bool wake_ok = false;
    for (int attempt = 1; attempt <= 5; attempt++) {
        if (i2c_master_transmit(imu_dev, wake_cmd, sizeof(wake_cmd),
                                 pdMS_TO_TICKS(100)) == ESP_OK) {
            g_imu_wake_attempts = attempt;
            wake_ok = true;
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(20));
    }
    if (!wake_ok) {
        g_imu_wake_attempts = -1;
        imu_dev = NULL;  /* wiring/address wrong - don't let later reads run */
    }

