ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
    /* Gyro zero-rate bias calibration (2026-08-28) - see g_gyro_z_bias_raw
     * comment above for the why. Runs once here, blocking, before either
     * task starts - the robot MUST be stationary through this (nothing else
     * is driving it yet at this point in boot, so that's already true).
     * Averages GYRO_CAL_SAMPLES readings rather than trusting one, to
     * average out ordinary per-sample sensor noise, not just the constant
     * bias. Only meaningful if the IMU actually woke - a dead/absent IMU
     * has nothing to calibrate, g_gyro_z_bias_raw stays at its 0.0f default
     * (imu_gz_valid_shared will be false anyway in that case, so this
     * bias is never even applied to anything). */
    if (wake_ok) {
        float bias_sum = 0.0f;
        int good_samples = 0;
        for (int i = 0; i < GYRO_CAL_SAMPLES; i++) {
            int16_t cal_ax, cal_ay, cal_az, cal_gx, cal_gy, cal_gz;
            if (imu_read_raw(&cal_ax, &cal_ay, &cal_az, &cal_gx, &cal_gy, &cal_gz)) {
                bias_sum += (float)cal_gz;
                good_samples++;
            }
            vTaskDelay(pdMS_TO_TICKS(10));
        }
        if (good_samples > 0) {
            g_gyro_z_bias_raw = bias_sum / (float)good_samples;
        }
    }

    /* GY-86/87-style boards wire the magnetometer through the MPU6050's own
     * AUX I2C bus, not straight onto the main SDA/SCL lines - confirmed
     * 2026-08-28: a bus scan found the MPU6050 (0x68) and the barometer
     * (0x77) directly, but NOTHING at the magnetometer's address, even
     * though it's the same physical board/wiring. Without this, the
     * compass is electrically invisible to the ESP32 no matter what
     * address setup_magnetometer() probes. Setting I2C_BYPASS_EN makes the
     * MPU6050 pass its aux bus straight through onto the main bus, so the
     * magnetometer becomes directly addressable. Only meaningful if the
     * MPU6050 itself is actually awake and responding. */
    if (wake_ok) {
        uint8_t bypass_cmd[2] = { MPU6050_REG_INT_PIN_CFG, MPU6050_I2C_BYPASS_EN };
        i2c_master_transmit(imu_dev, bypass_cmd, sizeof(bypass_cmd), pdMS_TO_TICKS(100));
        /* Not retried/checked - a failure here is already visible as
         * MAG=no-read on the dashboard, same as any other magnetometer
         * fault, no separate error path needed. */
    }

    /* Scan moved here (2026-08-28, was right after i2c_new_master_bus above)
     * - it used to run BEFORE the bypass write, so I2C=... on the dashboard
     * could never confirm whether bypass actually exposed a new address; it
     * was structurally incapable of answering that question. Now it runs
     * after wake + bypass, so I2C=... reflects the TRUE post-bypass bus
     * state - if the magnetometer still doesn't show up here, bypass mode
     * isn't the fix (wrong address / different chip / real hardware fault),
     * not a diagnostic blind spot. */
    i2c_scan_bus(bus_handle);

    /* Magnetometer (2026-08-28): separate I2C device on the same bus, wired
     * on the new GY-86/87-style board alongside this same MPU6050. Tried
     * unconditionally - it's a different chip at a different address, its
     * fate isn't tied to whether the MPU6050 wake above succeeded. */
    setup_magnetometer(bus_handle);
}

/* Burst-reads accel+temp+gyro (14 bytes from ACCEL_XOUT_H) and splits it
 * into the 6 raw int16 values callers actually want (temp bytes are read
 * and discarded - the sensor only supports reading this block contiguously,
 * there's no cheaper way to skip over temp mid-burst). Big-endian per
 * MPU6050's register layout (MSB byte first for every axis). */
#define IMU_MAX_CONSECUTIVE_FAILURES 5

/* Guards uros_task's control loop from a flaky/loose IMU wire: bounds each
 * stall tightly (a healthy MPU6050 answers in well under 1ms at 400kHz -
 * 5ms is already generous) AND gives up retrying after repeated failures
 * instead of eating that stall every single 100ms cycle forever. Matches
 * the same "don't let IMU trouble touch the proven motor/odom path"
 * philosophy as setup_imu()'s soft-fail. */
static bool imu_read_raw(int16_t *ax, int16_t *ay, int16_t *az,
                          int16_t *gx, int16_t *gy, int16_t *gz) {
    static uint8_t consecutive_failures = 0;

    if (imu_dev == NULL) {
        return false;
    }
    uint8_t reg = MPU6050_REG_ACCEL_XOUT_H;
    uint8_t data[IMU_READ_LEN];
    /* 2026-08-20: was 5ms. The wake-up write (a simpler transaction, no
     * repeated-start) succeeds on attempt 1 every time, but this combined
     * write+repeated-start+14-byte-read was failing 100% of the time at
     * 5ms - testing whether that's simply too tight for the more complex
     * transaction on this wiring, not a fully broken connection. */
    if (i2c_master_transmit_receive(imu_dev, &reg, 1, data, sizeof(data),
                                     pdMS_TO_TICKS(100)) != ESP_OK) {
        if (++consecutive_failures >= IMU_MAX_CONSECUTIVE_FAILURES) {
            imu_dev = NULL;  /* bus likely wedged - stop paying the stall */
        }
        return false;
    }
    consecutive_failures = 0;
    *ax = (int16_t)((data[0]  << 8) | data[1]);
    *ay = (int16_t)((data[2]  << 8) | data[3]);
    *az = (int16_t)((data[4]  << 8) | data[5]);
    /* data[6]/data[7] = temperature, unused here */
    *gx = (int16_t)((data[8]  << 8) | data[9]);
    *gy = (int16_t)((data[10] << 8) | data[11]);
    *gz = (int16_t)((data[12] << 8) | data[13]);
    return true;
}

/* Burst-reads 6 bytes starting at the X MSB register. HMC5883L's register
 * order is X, Z, Y - not X,Y,Z, confirmed against the datasheet - so the
 * parsing below deliberately doesn't follow the byte order line by line.
 * Same fail-soft/give-up-after-N-failures pattern as imu_read_raw() above. */
#define MAG_MAX_CONSECUTIVE_FAILURES 5

static bool mag_read_raw(int16_t *mx, int16_t *my, int16_t *mz) {
    static uint8_t consecutive_failures = 0;

    if (mag_dev == NULL) {
        return false;
    }
    uint8_t reg = HMC5883L_REG_DATA_X_MSB;
    uint8_t data[HMC5883L_READ_LEN];
    if (i2c_master_transmit_receive(mag_dev, &reg, 1, data, sizeof(data),
                                     pdMS_TO_TICKS(100)) != ESP_OK) {
        if (++consecutive_failures >= MAG_MAX_CONSECUTIVE_FAILURES) {
            mag_dev = NULL;  /* bus likely wedged - stop paying the stall */
        }
        return false;
    }
    consecutive_failures = 0;
    *mx = (int16_t)((data[0] << 8) | data[1]);
    *mz = (int16_t)((data[2] << 8) | data[3]);
    *my = (int16_t)((data[4] << 8) | data[5]);
    return true;
}

